app/controllers/todo_items_controller.rb

def create
    @todo_item = @todo_list.todo_items.new(todo_item_params)
    if @todo_item.save
---
INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "Work for the day"], ["todo_list_id", 5], ["created_at", "2015-05-24 18:16:29.288832"], ["updated_at", "2015-05-24 18:16:29.288832"]]

 def edit
  @todo_item = @todo_list.todo_items.find(params[:id])
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 5], ["id", 1]]

 def update

    @todo_item = @todo_list.todo_items.find(params[:id])
    if @todo_item.update_attributes(todo_item_params)
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 5], ["id", 2]]
UPDATE "todo_items" SET "content" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["content", "Lots of Milk"], ["updated_at", "2015-05-24 19:51:03.861962"], ["id", 1]]

    def complete
     @todo_item = @todo_list.todo_items.find(params[:id])
        @todo_item.update_attribute(:completed_at, Time.now)
---
SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 4], ["id", 4]]
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2015-05-28 10:48:40.843440"], ["updated_at", "2015-05-28 10:48:40.845415"], ["id", 4]]

 def find_todo_list
  @todo_list = TodoList.find(params[:todo_list_id])
---
SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."id" = ? LIMIT 1  [["id", 5]]